package 算法;

public class TodayCoding0510 {

	public static void main(String[] args) {
		

	}
	
	/**
	 * 题目6  将搜索二叉树转换为双向链表。
	 * 对搜索二叉树来说，有本身的值域，有指向左右孩子的两个指针。
	 * 对双向链表来说，有本身的值域，有指向上一个节点和下一个节点的指针。
	 * 在结构上他们有相似性，现在有一颗搜索二叉树，请将其转为一个有序的双向链表。
	 */
	
	
	/**
	 * 题目7 设计可以变更的缓存结构。
	 * 设计一种缓存结构，该结构在构造时确定大小，假设大小为k，
	 * 并有两个功能：
	 * 		*set(key,value);
	 * 		*get(key);
	 * 1 get,set的时间复杂度都要求为o(1)
	 * 2 LRU
	 */
	
	/**
	 * 题目8 
	 * 已知一个流会不断吐出整数1~N，但不一定按顺序吐出，根据以下描述设计一个结构，支持
	 * 接受和打印，流会吐出全部的1~N，当然也会都打印完，要求整个过程，时间复杂度为O(N).
	 */
	
}
