
public class ToayCoding0509 {
    public static void main(String[] args) {
        
    }
    //出现次数的TOP k问题
    //题目8 给定String类型的数组strArr,再给定整数k，请严格按照排名顺序打印出现次数前k名的字符串。
    //拓展：设计并实现TopRecord结构，可以不断地向其中加入字符串。并且可以随时打印加入次数最多前k个字符串。
    //相关Java类

    //题目9 有N个长度不一样的数组，所有数组升序排序。请从大到小打印这N个数组整体的前K个数。


    //题目10 有一个源源不断地吐出整数的数据流，假设你有足够的空间来保存吐出的数，请设计一个名叫MedianHolder的结构，可以方便得找到吐出所有得数得中位数。
    

    //题目13 K代表你一共可以选的项目数，W代表你的初始启动资金。
    //       Profits数组代表每个项目的收益，Capital数组代表每个项目需要的启动资金。一个项目能做的条件是你当前的
    //       启动资金大于项目的启动资金。一个项目做完后，该项目的收益会加到你的启动资金上，求你能够获得的最大收益。
    //       要求时间复杂度为O(N * log N).
}